'''
Function:
    logo程序
Author:
    花果山
Wechat official account：
    中龙 红客突击队
Official website：
    https://www.hscsec.cn/
Email：
    spmonkey@hscsec.cn
Blog:
    https://spmonkey.github.io/
GitHub:
    https://github.com/spmonkey/
'''
# -*- coding: utf-8 -*-


def logo():
    logo = """
  ________       .__       .___                      .__                                    .___ __________           .___
 /  _____/  ____ |  |    __| _/____   ____           |  |__   ____   ____ ______   ____   __| _/ \______   \ ____   __| _/
/   \  ___ /  _ \|  |   / __ |/ __ \ /    \   ______ |  |  \ /  _ \ /  _ \\\\____ \_/ __ \ / __ |   |       _//  _ \ / __ | 
\    \_\  (  <_> )  |__/ /_/ \  ___/|   |  \ /_____/ |   Y  (  <_> |  <_> )  |_> >  ___// /_/ |   |    |   (  <_> ) /_/ | 
 \______  /\____/|____/\____ |\___  >___|  /         |___|  /\____/ \____/|   __/ \___  >____ |   |____|_  /\____/\____ | 
        \/                  \/    \/     \/               \/              |__|        \/     \/          \/            \/ 

花果山出品
"""
    print(logo)
